{"id":2067,"date":"2013-07-25T21:12:45","date_gmt":"2013-07-25T21:12:45","guid":{"rendered":"http:\/\/romoscalaw.com\/?page_id=2067"},"modified":"2014-08-28T14:41:31","modified_gmt":"2014-08-28T18:41:31","slug":"wrongful-death","status":"publish","type":"page","link":"http:\/\/romoscalaw.com\/personal-injury\/wrongful-death\/","title":{"rendered":"Wrongful Death"},"content":{"rendered":"<div align=\"justify\">When you or your family has experienced serious personal injury or wrongful death as a result of someone’s negligence, you need an experienced attorney to stand up for your rights. We will work to get you full and fair compensation for your injuries, through settlement negotiation, mediation, litigation, or other dispute resolution techniques. We will seek justice for your injuries and damages which may include medical bills, lost wages, physical pain, mental suffering, permanent disability, permanent loss of enjoyment of life, scarring and disfigurement, loss of companionship, or wrongful death.<\/p>\n<p>Kevin C. Romosca is committed to providing aggressive representation to people injured in accidents in the following areas: Auto Accidents, Motorcycle Accidents, Truck Accidents, Medical Malpractice, Nursing Home Abuse\/Injuries, Premises Liability, Workers’ Compensation and Wrongful Death.<\/p><\/div>\n","protected":false},"excerpt":{"rendered":"<p>When you or your family has experienced serious personal injury or wrongful death as a result of someone’s negligence, you need an experienced attorney to stand up for your rights. We will work to get you full and fair compensation for your injuries, through settlement negotiation, mediation, litigation, or other dispute resolution techniques. We will seek justice for your injuries and damages which may include medical bills, lost wages, physical pain, mental suffering, permanent disability, permanent loss of enjoyment of life, scarring and disfigurement, loss of companionship, or wrongful death. Kevin C. Romosca is committed to providing aggressive representation to people injured in accidents in the following areas: Auto Accidents, Motorcycle Accidents, Truck Accidents, Medical Malpractice, Nursing Home Abuse\/Injuries, Premises Liability, Workers’ Compensation and Wrongful Death.<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":20,"menu_order":0,"comment_status":"open","ping_status":"open","template":"partials\/subpages3-template.php","meta":[],"_links":{"self":[{"href":"http:\/\/romoscalaw.com\/wp-json\/wp\/v2\/pages\/2067"}],"collection":[{"href":"http:\/\/romoscalaw.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"http:\/\/romoscalaw.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"http:\/\/romoscalaw.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/romoscalaw.com\/wp-json\/wp\/v2\/comments?post=2067"}],"version-history":[{"count":9,"href":"http:\/\/romoscalaw.com\/wp-json\/wp\/v2\/pages\/2067\/revisions"}],"predecessor-version":[{"id":2465,"href":"http:\/\/romoscalaw.com\/wp-json\/wp\/v2\/pages\/2067\/revisions\/2465"}],"up":[{"embeddable":true,"href":"http:\/\/romoscalaw.com\/wp-json\/wp\/v2\/pages\/20"}],"wp:attachment":[{"href":"http:\/\/romoscalaw.com\/wp-json\/wp\/v2\/media?parent=2067"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}