{"id":2061,"date":"2013-07-25T21:10:16","date_gmt":"2013-07-25T21:10:16","guid":{"rendered":"http:\/\/romoscalaw.com\/?page_id=2061"},"modified":"2018-12-27T15:05:14","modified_gmt":"2018-12-27T20:05:14","slug":"probation-revocations","status":"publish","type":"page","link":"http:\/\/my.romoscalaw.com\/dui-criminal-defense\/probation-revocations\/","title":{"rendered":"Probation Revocations"},"content":{"rendered":"<div align=\"justify\">Being charged with a crime is a serious and complicated matter. A criminal charge can affect your life, liberty, reputation, family and job. A criminal prosecution can involve an arrest, bond hearing, preliminary hearing, grand jury hearing, administrative hearing, discovery motions, pretrial motions, motions for the suppression of evidence, jury trial and appeal. The attorney defending your rights during this process makes a huge difference in the outcome of your case.<\/p>\n<p>If you are charged with a crime or believe you are the subject of a criminal investigation, it is critical to obtain an aggressive and experienced attorney as soon as possible. For more than 21 years, Kevin C. Romosca has worked within the criminal justice system, fighting for justice and protecting the rights of his clients. Kevin C. Romosca handles all types of misdemeanors and\/or felonies, including DUI\/DUAC, Drug Offenses, Violent Crimes and Property Crimes.<\/p>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>Being charged with a crime is a serious and complicated matter. A criminal charge can affect your life, liberty, reputation, family and job. A criminal prosecution can involve an arrest, bond hearing, preliminary hearing, grand jury hearing, administrative hearing, discovery motions, pretrial motions, motions for the suppression of evidence, jury trial and appeal. The attorney defending your rights during this process makes a huge difference in the outcome of your case. If you are charged with a crime or believe you are the subject of a criminal investigation, it is critical to obtain an aggressive and experienced attorney as soon as possible. For more than 21 years, Kevin C. Romosca has worked within the criminal justice system, fighting for justice and protecting the rights of his clients. Kevin C. Romosca handles all types of misdemeanors and\/or felonies, including DUI\/DUAC, Drug Offenses, Violent Crimes and Property Crimes.<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":17,"menu_order":0,"comment_status":"open","ping_status":"open","template":"partials\/subpages2-template.php","meta":[],"_links":{"self":[{"href":"http:\/\/my.romoscalaw.com\/wp-json\/wp\/v2\/pages\/2061"}],"collection":[{"href":"http:\/\/my.romoscalaw.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"http:\/\/my.romoscalaw.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"http:\/\/my.romoscalaw.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/my.romoscalaw.com\/wp-json\/wp\/v2\/comments?post=2061"}],"version-history":[{"count":12,"href":"http:\/\/my.romoscalaw.com\/wp-json\/wp\/v2\/pages\/2061\/revisions"}],"predecessor-version":[{"id":20901,"href":"http:\/\/my.romoscalaw.com\/wp-json\/wp\/v2\/pages\/2061\/revisions\/20901"}],"up":[{"embeddable":true,"href":"http:\/\/my.romoscalaw.com\/wp-json\/wp\/v2\/pages\/17"}],"wp:attachment":[{"href":"http:\/\/my.romoscalaw.com\/wp-json\/wp\/v2\/media?parent=2061"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}} 