{"id":10,"date":"2013-07-17T15:57:44","date_gmt":"2013-07-17T15:57:44","guid":{"rendered":"http:\/\/romoscalaw.com\/?page_id=10"},"modified":"2018-12-27T14:59:16","modified_gmt":"2018-12-27T19:59:16","slug":"attorney-profile","status":"publish","type":"page","link":"http:\/\/my.romoscalaw.com\/attorney-profile\/","title":{"rendered":"Attorney Profile"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-2510\" src=\"http:\/\/romoscalaw.com\/wp-content\/uploads\/2013\/07\/KevinRomasca_004_22-254x300.jpg\" alt=\"kevin romasca divorce lawyer greenville sc\" width=\"254\" height=\"300\" srcset=\"http:\/\/my.romoscalaw.com\/wp-content\/uploads\/2013\/07\/KevinRomasca_004_22-254x300.jpg 254w, http:\/\/my.romoscalaw.com\/wp-content\/uploads\/2013\/07\/KevinRomasca_004_22.jpg 600w\" sizes=\"(max-width: 254px) 100vw, 254px\" \/><\/p>\n<div align=\"justify\">Kevin C. Romosca was born in 1970. He attended public school in Anderson County, South Carolina and graduated from T.L. Hanna High School in 1989. He received his Bachelor of Science Degree in Business Administration with a Major in Finance from the University of South Carolina in 1993. He received his Juris Doctor Degree from the University of South Carolina School of Law in 1997.<\/p>\n<p>While at the University of South Carolina, he was the recipient of the Abney Scholarship Award and the Anderson Junior Assembly Scholarship. He was on the Dean’s List and President’s List. He was a member of Alpha Tau Omega fraternity.<\/p>\n<p>While in law school, he was the recipient of the I.M. Goldberg Scholarship, the South Carolina Trial Lawyers Association Scholarship, and he received the CALI Award in Professional Responsibility. He was a member of the Pi Delta Phi legal fraternity and on the Dean’s List.<\/p>\n<p>Upon graduating from law school in 1997, he served as a Law Clerk for the Honorable Joseph J. Watson in the South Carolina Circuit Court. Thereafter, he served as an Assistant Solicitor for the Thirteenth Judicial Circuit Solicitor’s Office in Greenville County. As an Assistant Solicitor, he worked in the General Prosecution Unit, prosecuting all levels of misdemeanors and felonies.<\/p>\n<p>Since 2001, Kevin has been in private practice, focusing on domestic, criminal and civil litigation. He is a member of the South Carolina Bar, Greenville County Bar Association, Opportunity Greenville, and he served on the Law Week Planning Committee. He is a member of Grace Church where he and his family are actively involved. In 2006, he was appointed Associate Judge for the Municipal Court for the City of Mauldin, where he served until 2008 as a part-time judge presiding over criminal matters and ordinance violations. Kevin is rated &#8220;<strong>AV Preeminent<\/strong>&#8221; by Martindale-Hubbell. This is the highest peer review ranking available and a testament that his peers rank him at the highest level of professional excellence in the areas of: Legal Knowledge, Analytical Capabilities, Judgment, Communication Ability and Legal Experience.<\/p>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>Kevin C. Romosca was born in 1970. He attended public school in Anderson County, South Carolina and graduated from T.L. Hanna High School in 1989. He received his Bachelor of Science Degree in Business Administration with a Major in Finance from the University of South Carolina in 1993. He received his Juris Doctor Degree from the University of South Carolina School of Law in 1997. While at the University of South Carolina, he was the recipient of the Abney Scholarship Award and the Anderson Junior Assembly Scholarship. He was on the Dean’s List and President’s List. He was a member of Alpha Tau Omega fraternity. While in law school, he was the recipient of the I.M. Goldberg Scholarship, the South Carolina Trial Lawyers Association Scholarship, and he received the CALI Award in Professional Responsibility. He was a member of the Pi Delta Phi legal fraternity and on the Dean’s List. Upon graduating from law school in 1997, he served as a Law Clerk for the Honorable Joseph J. Watson in the South Carolina Circuit Court. Thereafter, he served as an Assistant Solicitor for the Thirteenth Judicial Circuit Solicitor’s Office in Greenville County. As an Assistant Solicitor, he worked in the General Prosecution Unit, prosecuting all levels of misdemeanors and felonies. Since 2001, Kevin has been in private practice, focusing on domestic, criminal and civil litigation. He is a member of the South Carolina Bar, Greenville County Bar Association, Opportunity Greenville, and he served on the Law Week Planning Committee. He is a member of Grace Church where he and his family are actively involved. In 2006, he was appointed Associate Judge for the Municipal Court for the City of Mauldin, where he served until 2008 as a part-time judge presiding over criminal matters and ordinance violations. Kevin is rated &#8220;AV Preeminent&#8221; by Martindale-Hubbell. This is the highest peer review ranking available and a testament that his peers rank him at the highest level of professional excellence in the areas of: Legal Knowledge, Analytical Capabilities, Judgment, Communication Ability and Legal Experience.<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"open","ping_status":"open","template":"","meta":[],"_links":{"self":[{"href":"http:\/\/my.romoscalaw.com\/wp-json\/wp\/v2\/pages\/10"}],"collection":[{"href":"http:\/\/my.romoscalaw.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"http:\/\/my.romoscalaw.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"http:\/\/my.romoscalaw.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/my.romoscalaw.com\/wp-json\/wp\/v2\/comments?post=10"}],"version-history":[{"count":32,"href":"http:\/\/my.romoscalaw.com\/wp-json\/wp\/v2\/pages\/10\/revisions"}],"predecessor-version":[{"id":20897,"href":"http:\/\/my.romoscalaw.com\/wp-json\/wp\/v2\/pages\/10\/revisions\/20897"}],"wp:attachment":[{"href":"http:\/\/my.romoscalaw.com\/wp-json\/wp\/v2\/media?parent=10"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}} 