{"id":1983,"date":"2013-07-25T20:56:24","date_gmt":"2013-07-25T20:56:24","guid":{"rendered":"http:\/\/romoscalaw.com\/?page_id=1983"},"modified":"2014-08-14T14:46:10","modified_gmt":"2014-08-14T14:46:10","slug":"custody","status":"publish","type":"page","link":"http:\/\/romoscalaw.com\/family-law\/custody\/","title":{"rendered":"Custody"},"content":{"rendered":"<div align=\"justify\">There are two types of custody, legal and physical. Custody can also be joint, sole, or split. <\/p>\n<p>In South Carolina, the “best interest of the child” is the controlling factor in all custody cases. In determining the best interest of a child in a custody dispute, the Family Court will consider several factors, including: who has been the primary caretaker; the conduct, attributes, and fitness of the parents; the opinions of third parties (including the guardian ad litem, expert witnesses, and the children); and the age, health, and sex of the children.    <\/p>\n<p>The Court will consider the character, fitness, attitude, and inclinations on the part of each parent as they impact the child as well as all psychological, physical, environmental, spiritual, educational, medical, family, emotional, and recreational aspects of the child’s life. When determining to whom custody shall be awarded, the court should consider all the circumstances of the particular case and all relevant factors must be taken into consideration. <\/p>\n<p>For case law discussing custody, see Pirayesh v. Pirayesh, 359 S.C. 284, 596 S.E.2d 505 (2004).<\/p><\/div>\n","protected":false},"excerpt":{"rendered":"<p>There are two types of custody, legal and physical. Custody can also be joint, sole, or split. In South Carolina, the “best interest of the child” is the controlling factor in all custody cases. In determining the best interest of a child in a custody dispute, the Family Court will consider several factors, including: who has been the primary caretaker; the conduct, attributes, and fitness of the parents; the opinions of third parties (including the guardian ad litem, expert witnesses, and the children); and the age, health, and sex of the children. The Court will consider the character, fitness, attitude, and inclinations on the part of each parent as they impact the child as well as all psychological, physical, environmental, spiritual, educational, medical, family, emotional, and recreational aspects of the child’s life. When determining to whom custody shall be awarded, the court should consider all the circumstances of the particular case and all relevant factors must be taken into consideration. For case law discussing custody, see Pirayesh v. Pirayesh, 359 S.C. 284, 596 S.E.2d 505 (2004).<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":14,"menu_order":0,"comment_status":"open","ping_status":"open","template":"partials\/subpages1-template.php","meta":[],"_links":{"self":[{"href":"http:\/\/romoscalaw.com\/wp-json\/wp\/v2\/pages\/1983"}],"collection":[{"href":"http:\/\/romoscalaw.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"http:\/\/romoscalaw.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"http:\/\/romoscalaw.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/romoscalaw.com\/wp-json\/wp\/v2\/comments?post=1983"}],"version-history":[{"count":14,"href":"http:\/\/romoscalaw.com\/wp-json\/wp\/v2\/pages\/1983\/revisions"}],"predecessor-version":[{"id":2449,"href":"http:\/\/romoscalaw.com\/wp-json\/wp\/v2\/pages\/1983\/revisions\/2449"}],"up":[{"embeddable":true,"href":"http:\/\/romoscalaw.com\/wp-json\/wp\/v2\/pages\/14"}],"wp:attachment":[{"href":"http:\/\/romoscalaw.com\/wp-json\/wp\/v2\/media?parent=1983"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}